# -*- coding: utf-8 -*-#

#-------------------------------------------------------------------------------
# Name:         testNumpy
# Description:  列表、数组、矩阵三者的测试，发现数组和列表有相同的用法，但也一定要区分类型，运算的时候可能会有差别。
#                矩阵一定是二维的。在python中，[]可能是相当于一行数据的分隔。
# Author:       adwin
# Date:         2020-09-16
#-------------------------------------------------------------------------------

from numpy import *

# 1.列表定义
a1 = [[1,2,3],[4,5,6]]
print(a1[1][1])
print("列表：",a1)

# 2.列表——>数组
a2 = array(a1)
print(a2[0,2])
print("列表——>数组：",a2)


# 3.列表——>矩阵
a3 = mat(a1)
print("列表——>矩阵：",a3)

# 4.数组——>列表
a4 = a2.tolist()
print("数组——>列表：",a4)

# 5.矩阵——>数组
a6 = array(a3)
print("矩阵——>数组：",a6)

# 高维数组测试
a7 = [[[1,2,3],[4,5,6]],[[7,8,9],[10,11,12]]]
print("高维列表：",a7)
print("高维列表：",a7[1])
a8 = array(a7)
print("高维数组：",a8)
print("高维数组：",a8[1][1])